import pandas as pd

data = {
    "Ученик": ["Ученик 1", "Ученик 2", "Ученик 3", "Ученик 4", "Ученик 5",
               "Ученик 6", "Ученик 7", "Ученик 8", "Ученик 9", "Ученик 10"],
    "Математика": [85, 91, 76, 89, 65, 90, 82, 78, 85, 92],
    "Физика": [78, 85, 84, 90, 72, 87, 79, 74, 83, 88],
    "Химия": [92, 89, 70, 95, 60, 94, 88, 80, 85, 91],
    "Литература": [74, 80, 68, 85, 70, 91, 78, 72, 89, 94],
    "История": [88, 90, 75, 93, 67, 95, 82, 77, 84, 90]
}

df = pd.DataFrame(data)
print(df)
